HopeFOAM-0.1/tutorials/DG/2D/pearsonVortex/system/blockMeshDict
/*------------------------------------------------------------------------------------*\
|     __  ______  ____  ______ |                                                       |
|    / / / / __ \/ __ \/ ____/ | HopeFOAM: High Order Parallel Extensible CFD Software |
|   / /_/ / / / / /_/ / __/    |                                                       |
|  / __  / /_/ / ____/ /___    |                                                       |
| /_/ /_/\____/_/   /_____/    | Copyright(c) 2017-2017 The Exercise Group, AMS, China.|
|                              |                                                       |
\*------------------------------------------------------------------------------------*/
FoamFile
{
    version     0.1;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 0.5 0)
    (-0.5 0 0)
    (-0.5 -0.5 0)
    (0 0.5 0)
    (0 0 0)
    (0 -0.5 0)
    (0.5 0.5 0)
    (0.5 0 0)
    (0.5 -0.5 0)
    (-0.5 0.5 0.1)
    (-0.5 0 0.1)
    (-0.5 -0.5 0.1)
    (0 0.5 0.1)
    (0 0 0.1)
    (0 -0.5 0.1)
    (0.5 0.5 0.1)
    (0.5 0 0.1)
    (0.5 -0.5 0.1)
);

blocks
(
    hex (0 1 4 3 9 10 13 12) (8 8 1) simpleGrading (1 1 1)
    hex (1 2 5 4 10 11 14 13) (8 8 1) simpleGrading (1 1 1)
    hex (3 4 7 6 12 13 16 15) (8 8 1) simpleGrading (1 1 1)
    hex (4 5 8 7 13 14 17 16) (8 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (2 11 10 1)
	    (8 17 14 5)
	    (6 15 16 7)
	    (0 9 12 3)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 10 9 0)
            (5 14 11 2)
            (7 16 17 8)
	    (3 12 15 6)
        );
    }
    frontAndBackPlanes
    {
        type empty;
        faces
        (
            (1 0 3 4)
	    (10 13 12 9)
            (2 1 4 5)
	    (11 14 13 10)
	    (5 4 7 8)
	    (14 17 16 13)
	    (4 3 6 7)
	    (13 16 15 12)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
