HopeFOAM-0.1/tutorials/DG/2D/pearsonVortex/system/dgSolution
/*------------------------------------------------------------------------------------*\
|     __  ______  ____  ______ |                                                       |
|    / / / / __ \/ __ \/ ____/ | HopeFOAM: High Order Parallel Extensible CFD Software |
|   / /_/ / / / / /_/ / __/    |                                                       |
|  / __  / /_/ / ____/ /___    |                                                       |
| /_/ /_/\____/_/   /_____/    | Copyright(c) 2017-2017 The Exercise Group, AMS, China.|
|                              |                                                       |
\*------------------------------------------------------------------------------------*/
FoamFile
{
    version     0.1;
    format      ascii;
    class       dictionary;
    location    "system";
    object      dgSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DG
{
    meshDimension       2;
    baseOrder           2;
}

solvers
{
    p
    {
        kspSolver		cg;
        kspPC			lu;
	preconditioner	       DIC;
        tolerance            1e-12;
        relTol                   0;
    }

    pZero
    {
	kspSolver		cg;
	kspPC			lu;
	preconditioner	       DIC;
	tolerance            1e-12;
	relTol			0;
    }

    convecU
    {
	kspSolver         preonly;
        kspPc                  lu;
        preconditioner        DIC;
	tolerance           1e-12;
	relTol                  0;
    }

    pT
    {
        kspSolver        preonly;
        kspPC	              lu;
        tolerance          1e-12;
        relTol                 0;
    }

    pCorr1
    {
	kspSolver       preonly;
	kspPC	             lu;
	tolerance         1e-12;
	relTol		      0;
    }

    pCorr2
    {
	kspSolver	preonly;
	kspPC		     lu;
	tolerance	  1e-12;
	relTol		      0;
    }

    U
    {
        kspSolver	preonly;
        kspPC		     lu;
	smoother symGaussSeidel;
        tolerance         1e-12;
        relTol                0;
    }

    UZero
    {
	kspSolver       preonly;
	kspPC                lu;
	smoother symGaussSeidel;
	tolerance         1e-12;
	relTol          0;
    }

    UT
    {
	kspSolver       preonly;
	kspPc                lu;
        preconditioner      DIC;
	tolerance         1e-12;
	relTol                0;
	}
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
